import pytest


@pytest.fixture
def sample_dates() -> list[dict]:
    """Фикстура с тестовыми данными для проверки фильтрации"""
    return [
        {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
        {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
        {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
        {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
    ]


@pytest.fixture
def operations() -> list[dict]:
    """Фикстура с тестовыми данными для проверки сортировки по дате"""
    return [
        {"id": 1, "date": "2023-01-01T10:00:00.000000"},
        {"id": 2, "date": "2023-03-01T10:00:00.000000"},
        {"id": 3, "date": "2023-02-01T10:00:00.000000"},
        {"id": 4, "date": "2023-02-01T10:00:00.000000"},
    ]
